Revit 2027 API
DuctSettings.FlatOnBottom Property
 The abbreviation of the Flat On Bottom (FOB) string.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string FlatOnBottom { get; set; }
Public Property FlatOnBottom As String
	Get
	Set
public:
property String^ FlatOnBottom {
	String^ get ();
	void set (String^ value);
}
member FlatOnBottom : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace